/**
  *******************************************************************************************************
  * File Name: drv_rcc.c
  * Author: Vector
  * Version: V1.0.0
  * Date: 2018-2-1
  * Brief: KEA128芯片RCC底层驱动函数
  *******************************************************************************************************
  * History
  *		1.Data: 2018-2-1
  *     Author: Vector
  *     Mod: 建立文件,添加基本函数
  *
  *******************************************************************************************************
  */

# include "drv_rcc.h"

/*
*********************************************************************************************************
*                               drv_rcc_ClockCmd           
*
* Description: 使能外设时钟
*             
* Arguments  : 1> PeriphColck: 外设时钟
*              2> NewState: 使能选项
*
* Reutrn     : None.
*
* Note(s)    : None.
*********************************************************************************************************
*/
void drv_rcc_ClockCmd(uint32_t PeriphColck, FunctionalState NewState)
{
	if(NewState != DISABLE)
	{
		SIM->SCGC |= PeriphColck;
	}
	else
	{
		SIM->SCGC &= ~PeriphColck;
	}
}




